# Music Charts

In this example, we will extract information about music charts from tables on Wikipedia.
We will populate the Wikidata predicate "charted in" ([P2291](https://www.wikidata.org/wiki/Property:P2291)), which often occurs with the qualifiers "point in time" ([P585](https://www.wikidata.org/wiki/Property:P585)) and "ranking" ([P1352](https://www.wikidata.org/wiki/Property:P1352)).

In [1]:
%matplotlib inline
%load_ext autoreload
%autoreload 2

In [2]:
from IPython.display import HTML

def preview_tables(tables, n=None):
    content = ""
    for i,table in enumerate(tables):
        df = takco.extract.htmltables.tableobj_to_dataframe(table)
        head = df.head()._repr_html_()
        content += f"<span style='align-self: flex-start; margin: 1em; '>{head}</span>"
        if n and i>n:
            break
    return HTML(f'<div style="width: 100%; overflow-x: scroll; white-space: nowrap; display:flex;">{content}</div>')

In [3]:
import takco

pred_charted_in = "http://www.wikidata.org/prop/direct/P2291"
pages = takco.wiki(pred=pred_charted_in, sample=10)
extracted = takco.TableSet.extract(source = pages)

print(f"Got {len(list(extracted))} tables")
preview_tables(extracted, 25)

Got 39 tables

In [4]:
reshaped = takco.TableSet.reshape(extracted)
print(f"Got {len(list(reshaped))} tables")
preview_tables(reshaped, 25)

Got 39 tables

In [5]:
clustered = takco.TableSet.cluster(reshaped, addcontext = ["pgTitle"], matchers=[])

print(f"Got {len(list(clustered))} tables")
preview_tables(clustered, 25)

Got 18 tables

In [6]:
linked = takco.TableSet.link(clustered, lookup_cells=False, linker_config = {}, lookup_config = {
    'class': 'SQLiteWikiLookup',
    'sqlitedb': '../../data/wdid_wpname.sqlitedb',
    'baseuri': 'http://www.wikidata.org/entity/',
    'fallback': {'class': 'MediaWikiAPI'},
})

print(f"Got {len(list(linked))} tables")
preview_tables(linked, 25)

Got 18 tables

In [18]:
searcher_config = {
    'class': "RDFSearcher",
    'encoding': "wikidata",
    'typeProperties': ["http://www.wikidata.org/prop/direct/P31"],
    'statementURIprefix': "http://www.wikidata.org/entity/statement/",
    'store': {
        'class': "HDTStore",
        'path': "/export/scratch1/home/kruit/scratch/downloads/wikidata/wikidata20200309.hdt",
    }
}
integrated = takco.TableSet.integrate(linked, pfd_threshold = 0.95, searcher_config=searcher_config)

from IPython.display import display

for table in sorted(integrated, key=lambda table: -table.get('numDataRows', 0)):
    df = takco.extract.htmltables.tableobj_to_dataframe(table)
    display( df.head() )
    print(f'Table has {len(df)} rows')
    display( table.get('properties') )
    print()

,_Page,Peak position,Variable,Chart
0,We No Speak Americano,4,2010–11,Australia ( ARIA )
1,We No Speak Americano,1,2010–11,Austria ( Ö3 Austria Top 40 )
2,We No Speak Americano,1,2010–11,Belgium ( Ultratop 50 Flanders)
3,We No Speak Americano,1,2010–11,Belgium ( Ultratop 50 Wallonia)
4,We No Speak Americano,1,2010–11,Bulgaria ( IFPI )

Table has 119 rows

{0: {3: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P2291'): 0.10084033613445378},
  1: {rdflib.term.URIRef('http://www.wikidata.org/prop/qualifier/P1352'): 0.07563025210084033},
  2: {rdflib.term.URIRef('http://www.wikidata.org/prop/qualifier/P585'): 0.06722689075630252}}}

                   _Page Position Variable                        Chart
0  We No Speak Americano       93     2011    Canada (Canadian Hot 100)
1  We No Speak Americano       51     2011       Hungary (Dance Top 40)
2  We No Speak Americano       34     2010             Australia (ARIA)
3  We No Speak Americano        1     2010  Austria (Ö3 Austria Top 40)
4  We No Speak Americano        3     2010  Belgium (Ultratop Flanders)

Table has 48 rows

{0: {3: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P2291'): 0.020833333333333332}}}

                    _Page                Source         Rating
0  LOL (Basshunter album)         Review scores  Review scores
1  LOL (Basshunter album)              AllMusic    3.5/5 stars
2     The Best Damn Thing         Review scores  Review scores
3     The Best Damn Thing              AllMusic    4.5/5 stars
4     The Best Damn Thing  Entertainment Weekly            (B)

Table has 45 rows

{}

,_Page,Region,Certification,Certified units /sales
0,We No Speak Americano,Australia ( ARIA ),2× Platinum,"140,000 ^"
1,We No Speak Americano,Belgium ( BEA ),Platinum,"30,000 *"
2,We No Speak Americano,Denmark ( IFPI Denmark ),Platinum,"30,000 ^"
3,We No Speak Americano,Germany ( BVMI ),2× Platinum,"600,000 ^"
4,We No Speak Americano,Italy ( FIMI ),Platinum,"30,000 *"

Table has 44 rows

{}

,_Page,Publisher,Accolade,Year,Rank
0,Everything That Happens Will Happen Today,ABC News,The 50 Best Albums of 2008,2009,46
1,Everything That Happens Will Happen Today,AllMusic,AllMusic's Favorite Rock Albums of 2008,2008,"Unranked, out of 25"
2,Everything That Happens Will Happen Today,Amazon.com editors' picks,Amazon Music: Best of 2008,2009,62
3,Everything That Happens Will Happen Today,The Buffalo News,Best Albums (2000–2010),2010,Honorable mention
4,Everything That Happens Will Happen Today,Chicago Sun-Times ( Jim DeRogatis ),The Best Albums of 2008,2008,2

Table has 15 rows

{}

,_Page,Year,Chart,Peak position
0,Thick as a Brick,1972,Australian Albums ( Kent Music Report ),1
1,Thick as a Brick,1972,Canadian Albums ( RPM ),1
2,Thick as a Brick,1972,Danish Albums ( Tracklisten ),1
3,Thick as a Brick,1972,German Albums ( Offizielle Top 100 ),2
4,Thick as a Brick,2012,German Albums ( Offizielle Top 100 ) 40th Anni...,53

Table has 11 rows

{0: {2: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P2291'): 0.09090909090909091},
  3: {rdflib.term.URIRef('http://www.wikidata.org/prop/qualifier/P1352'): 0.09090909090909091}}}

,_Page,Award,Year,Category,Result,Ref.
0,The Best Damn Thing,Hong Kong Top Sales Music Awards,2007,Top Ten Best Selling Foreign Albums,Won,
1,The Best Damn Thing,Japan Gold Disc Awards,2008,Album of the Year,Won,
2,The Best Damn Thing,Japan Gold Disc Awards,2008,Best 3 Albums,Won,
3,The Best Damn Thing,Juno Award,2008,Album of the Year,Nominated,
4,The Best Damn Thing,MTV Europe Music Awards,2007,Best Album,Nominated,

Table has 7 rows

{3: {1: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P31'): 0.42857142857142855}},
 0: {3: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P166'): 0.14285714285714285}}}

,_Page,Region,Peak position,Variable,Sales charts
0,Everything That Happens Will Happen Today,Australia,66,2009,ARIA Albums Chart
1,Everything That Happens Will Happen Today,Belgium,58,2009,Belgian (Wallonian) Albums Chart
2,Everything That Happens Will Happen Today,New Zealand,31,2009,Official New Zealand Music Chart
3,Everything That Happens Will Happen Today,United States,174,2009,US Billboard 200
4,Everything That Happens Will Happen Today,France,127,2008,Syndicat National de l'Édition Phonographique

Table has 6 rows

{0: {4: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P2291'): 0.6666666666666666},
  2: {rdflib.term.URIRef('http://www.wikidata.org/prop/qualifier/P1545'): 0.5},
  3: {rdflib.term.URIRef('http://www.wikidata.org/prop/qualifier/P585'): 0.6666666666666666}}}

,_Page,Region,Date,Format,Distributing Label,Catalog codes
0,Aruku Around,Japan,"November 30, 2009 ( 2009-11-30 )",radio debut,Victor Entertainment,
1,Aruku Around,Japan,"December 2, 2009 ( 2009-12-02 )",ringtone,Victor Entertainment,
2,Aruku Around,Japan,"January 6, 2010 ( 2010-01-06 )",digital download,Victor Entertainment,VEAML-23806
3,Aruku Around,Japan,"January 13, 2010 ( 2010-01-13 )","CD single , limited edition CD single",Victor Entertainment,"VICL-36553, VICL-36554"
4,Aruku Around,South Korea,"January 18, 2010 ( 2010-01-18 )",digital download,J-Box Entertainment,

Table has 6 rows

{4: {1: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P17'): 0.6666666666666666}},
 0: {4: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P264'): 0.6666666666666666}}}

,_Page,Country,Date,Format,Label,Ref.
0,Stronger (Britney Spears song),Germany,"November 13, 2000",CD single,Jive Zomba,
1,Stronger (Britney Spears song),France,"November 21, 2000",CD single,Jive Zomba,
2,Stronger (Britney Spears song),Japan,"December 6, 2000",CD single,Jive Zomba,
3,Stronger (Britney Spears song),United States,"December 12, 2000",CD single (The Remixes),Jive Zomba,
4,Stronger (Britney Spears song),United States,"December 12, 2000","12""",Jive Zomba,

Table has 6 rows

{0: {4: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P264'): 1.0}}}

,_Page,Peak position,Variable,Charts
0,Aruku Around,9,2010,Japan Billboard Adult Contemporary Airplay
1,Aruku Around,4,2010,Japan Billboard Japan Hot 100
2,Aruku Around,2,2010,Japan Oricon daily singles
3,Aruku Around,3,2010,Japan Oricon weekly singles
4,Aruku Around,38,2010,Japan RIAJ Digital Track Chart

Table has 5 rows

{}

                     0          1                2         3                 4
0  The Best Damn Thing  Summaries  Europe ( IFPI )  Platinum       1,000,000 *
1  The Best Damn Thing  Summaries        Worldwide         —         6,000,000
2     Thick as a Brick    Country     Organization      Year             Sales
3     Thick as a Brick        USA             RIAA      1972  Gold (+ 500,000)

Table has 4 rows

{}

,_Page,Date,Single,Chart,Position
0,Peter Gabriel (1980 album),1980,Games Without Frontiers,Billboard Pop Singles,48
1,Peter Gabriel (1980 album),Feb 1980,Games Without Frontiers,UK Singles Chart,4
2,Peter Gabriel (1980 album),May 1980,No Self Control,UK Singles Chart,33
3,Peter Gabriel (1980 album),Aug 1980,Biko,UK Singles Chart,38

Table has 4 rows

{}

                 _Page        Country            Date     Label
0  The Best Damn Thing          Italy  April 11, 2007  Sony BMG
1  The Best Damn Thing        Germany  April 13, 2007  Sony BMG
2  The Best Damn Thing         Canada  April 17, 2007  Sony BMG
3  The Best Damn Thing  United States  April 17, 2007       RCA

Table has 4 rows

{0: {3: {rdflib.term.URIRef('http://www.wikidata.org/prop/statement/P264'): 0.25}}}

          _Page                         Chart               Amount
0  Aruku Around         Oricon physical sales               27,000
1  Aruku Around  RIAJ downloads certification  Platinum (250,000+)

Table has 2 rows

{}

                        _Page  Year                 Chart Position
0  Peter Gabriel (1980 album)  1980  Billboard Pop Albums       22
1  Peter Gabriel (1980 album)  1980        UK Album Chart        1

Table has 2 rows

{}

                        _Page Organization Level         Date
0  Peter Gabriel (1980 album)     BPI – UK  Gold  2 June 1980

Table has 1 rows

{}

,_Page,Year,Award,Nominee/work,Result,Ref.
0,LOL (Basshunter album),2008,European Border Breakers Award,LOL,Won,

Table has 1 rows

{}